#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_address.static_ip: Refreshing state... [id=projects/minecraft-abekoh/regions/asia-northeast1/addresses/minecraft-server-static-ip]
google_compute_network.vpc_network: Refreshing state... [id=projects/minecraft-abekoh/global/networks/minecraft-network]
google_compute_disk.game_data_disk: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/disks/game-data-disk]
google_compute_firewall.allow_minecraft: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-minecraft]
google_compute_firewall.allow_icmp: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-icmp]
google_compute_firewall.allow_ssh: Refreshing state... [id=projects/minecraft-abekoh/global/firewalls/allow-ssh]
google_compute_instance.bot_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh-discord-bot]
google_compute_instance.vm_instance: Refreshing state... [id=projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.bot_instance must be replaced
-/+ resource "google_compute_instance" "bot_instance" {
      ~ cpu_platform         = "Intel Broadwell" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh-discord-bot" -> (known after apply)
      ~ instance_id          = "2510927039388270970" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      ~ metadata_fingerprint = "2Zpe4c7HITY=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "minecraft-abekoh-discord-bot"
      ~ project              = "minecraft-abekoh" -> (known after apply)
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/zones/asia-northeast1-b/instances/minecraft-abekoh-discord-bot" -> (known after apply)
      - tags                 = [] -> null
      ~ tags_fingerprint     = "42WmSpB8rSM=" -> (known after apply)
      ~ zone                 = "asia-northeast1-b" -> "us-central1-b" # forces replacement
        # (4 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/zones/asia-northeast1-b/disks/minecraft-abekoh-discord-bot" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/global/networks/minecraft-network" -> "minecraft-network"
          ~ network_ip         = "10.146.0.10" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/minecraft-abekoh/regions/asia-northeast1/subnetworks/minecraft-network" -> (known after apply)
          ~ subnetwork_project = "minecraft-abekoh" -> (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }


      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @abekoh, Action: `pull_request`, Working Directory: ``, Workflow: `validate & plan Terraform`*